export default {
  projections: {
    РасчетныйЛистE: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      отправлен: {
        __caption__: 'Отправлен'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        },
        имя: {
          __caption__: 'Имя'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      составРасчета: {
        __caption__: 'Состав расчета',
        тип: {
          __caption__: 'Тип'
        },
        наименование: {
          __caption__: 'Наименование'
        },
        сумма: {
          __caption__: 'Сумма'
        },
        ндфл: {
          __caption__: 'Ндфл'
        },
        взносы: {
          __caption__: 'Взносы'
        },
        всего: {
          __caption__: 'Всего'
        }
      }
    },
    РасчетныйЛистL: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      отправлен: {
        __caption__: 'Отправлен'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        },
        имя: {
          __caption__: 'Имя'
        },
        отчество: {
          __caption__: 'Отчество'
        },
        должности: {
          __caption__: '',
          наименование: {
            __caption__: 'Должность'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата составления'
    },
    номер: {
      __caption__: 'Номер'
    },
    отправлен: {
      __caption__: 'Отправлен'
    },
    сотрудники: {
      __caption__: 'Фамилия'
    },
    составРасчета: {
      __caption__: 'Состав расчета'
    }
  }
};
